# basics
brew 'mas'
brew 'bat'
brew 'watch'
brew 'wget'
brew 'jq'
brew 'tldr'
brew 'openssl'
brew 'rar'
brew 'tree'
cask 'iterm2'
brew 'zsh'
brew 'zsh-syntax-highlighting'
tap "romkatv/powerlevel10k"
brew "powerlevel10k"
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'
cask 'font-menlo-for-powerline'
brew 'bitwarden-cli'
cask 'dropbox'
cask 'google-drive'
brew 'nmap'

# development
brew 'terraform'
brew 'kubectl'
brew 'awscli'
cask 'docker'
cask 'google-cloud-sdk'
brew 'minikube'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'insomnia'
tap 'AdoptOpenJDK/openjdk'
cask 'AdoptOpenJDK/openjdk/adoptopenjdk8'
cask 'AdoptOpenJDK/openjdk/adoptopenjdk11'
brew 'nvm'
brew 'yarn'
cask 'sublime-text'
cask 'dotnet-sdk'
cask 'visual-studio-code'
tap 'homebrew/cask-versions'
cask 'visual-studio'
brew 'pidcat'
brew 'carthage'
brew 'v8' # for ruby
brew 'gnupg' # for rvm


# usability
cask 'bettertouchtool'
cask 'scroll-reverser'

# finances
cask 'gnucash'

# media
cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'skype'
cask 'kindle'
cask 'spotify'
tap 'homebrew/cask-drivers'
cask 'sonos'
cask 'vlc'
cask 'snagit'
