# basics
brew 'mas'
brew 'bat'
brew 'watch'
brew 'wget'
brew 'jq'
brew 'openssl'
brew 'unrar'
brew 'tree'
cask 'iterm2'
cask '1password'
cask '1password-cli'

# development
brew 'kubectl'
cask 'docker'
cask 'minikube'
cask 'jetbrains-toolbox'
cask 'charles'
cask 'postman'
tap 'adoptopenjdk/openjdk'
cask 'adoptopenjdk8'
cask 'adoptopenjdk11'
brew nvm

# usability
cask 'bettertouchtool'
cask 'scroll-reverser'

# media
cask 'google-chrome'
cask 'slack'
cask 'skype'
cask 'kindle'
cask 'spotify'
cask 'sonos'
cask 'vlc'
